# -*- coding:utf8 -*- #
# -----------------------------------------------------------------------------------
# ProjectName:   python_advance_code
# FileName:     fork_d.py
# Author:      Jakiro
# Datetime:    2022/4/28 13:39
# Description:
# 命名规则  文件名小写字母+下划线，类名大驼峰，方法、变量名小写字母+下划线连接
# 常量大写，变量和常量用名词、方法用动词
# -----------------------------------------------------------------------------------

a = 60  # 00111100
b = 13  # 00001101
c = 0

# & 按位与运算符：参与运算的两个值,如果两个相应位都为1,则该位的结果为1,否则为0
c = a & b  # 00001100  12
print(c)

# | 按位或运算符：只要对应的二个二进位有一个为1时，结果位就为1。
c = a | b  # 00111101 61
print(c)

# ^ 	按位异或运算符：当两对应的二进位相异时，结果为1
c = a ^ b # 00110001  49

# ~ 按位取反运算符：对数据的每个二进制位取反,即把1变为0,把0变为1。~x 类似于 -x-1
c = ~a # 11000011
print(c)
#<< 左移动运算符：运算数的各二进位全部左移若干位，由"<<"右边的数指定移动的位数，高位丢弃，低位补0。
c = a <<2 # 11110000 240
print(c)
# >>	右移动运算符：把">>"左边的运算数的各二进位全部右移若干位，">>"右边的数指定移动的位数
c= a>>2  #  00001111
print(c)